<?php

for ($i = 1; $i<= 100; $i++) {
    if ($i % 3 === 0 && $i % 5 === 0 ) {
        echo 'FizzBuzz' ;
    } elseif ($i %5 ===0) {
        echo 'Buzz' ;
    } elseif ($i %3 ===0) {
        echo 'Fizz' ;
    } else {
        echo $i ;
    }
    echo '<br>';
}

for ($x = 1; $x <=10000; $x++){
    $point = 0;
    for ($y = 1; $y <= $x; $y++){
        if($x % $y ==0){
            $point +=1;
        }
    }
 if ($point == 2) {
     echo $x . "\n";
 }
 echo '<br>';
}

$array = [
    ['ジョングク','24才','男性','178センチ','釜山'],
    ['テヒョン','25才','男性','179センチ','大邱'],
    ['ジミン','25才','男性','174センチ','釜山'],
    ['ナムジュン','26才','男性','181センチ','高陽'],
    ['ホソク','27才','男性','177センチ','光州'],
    ['ユンギ','28才','男性','174センチ','大邱'],
    ['ソクジン','28才','男性','179センチ','果川']
];

var_dump($array);

echo '<br>';
